<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Strict//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>

<head>
  <title>Exercice: structuration d'informations</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body>

<p>Cet exercice est du même type que l'<a href="exo1.html">exercice précédent</a>. Il s'agit de structurer, sous la forme d'un fichier <code>XML</code>, le texte suivant&nbsp;:</p>

<blockquote>
            <p>Il existe diverses vari&eacute;t&eacute;s de nuages. La plupart de ceux dont nous allons parler ne produit aucun "hydrom&eacute;t&eacute;ore", sauf le cumulonimbus, qui est accompagn&eacute; d'averses (parfois sous la forme de neige, de gr&eacute;sil ou de gr&ecirc;le).</p>
            <p>L'altocumulus et le cirrocumulus partagent les m&ecirc;mes "esp&egrave;ces"&nbsp;: <i>lenticularis</i>, <i>stratiformis</i>, <i>castellanus</i> et <i>flocus</i>. On retrouve ces deux esp&egrave;ces &eacute;galement chez le cirrus, ainsi que les esp&egrave;ces <i>spissatus</i>, <i>uncinus</i> et <i>fibratus</i>. Les esp&egrave;ces <i>stratiformis</i>, <i>lenticularis</i> et <i>castellanus</i> sont quant &agrave; elles partag&eacute;es &eacute;galement avec les strato-cumulus.</p>
            <p>Ces derniers peuvent se tra&icirc;ner au ras du sol et monter &agrave; 2000m, mais certains nuages ont une altitude minimale &agrave; peine plus &eacute;lev&eacute;e, puisqu'elle n'est que de 200m pour les cumulus, et de 300m pour les cumulonimbus. Il est vrai que ces derniers compensent en montant jusqu'&agrave; une altitude maximale de 18000m, soit plus haut encore que les cirrus, qui plafonnent &agrave; 12000m. L'altitude minimale de ces derniers co&iuml;ncide avec la fin de la pr&eacute;sence possible des altocumulus, &agrave; 6000m. Et c'est autour de cette zone, entre 5000 et 7000m, que se trouvent les cirrocumulus. L'altitude minimale des altocumulus est de 2000m, soit quatre fois moins que l'altitude maximale des cumulus.</p>
            <p>Ces pauvres cumulus ne sont pas favoris&eacute;s en nom d'esp&egrave;ces, puisqu'ils se trouvent afflig&eacute;s de noms tels que <i>fractus</i>, <i>mediocris</i>, <i>humilis</i> et <i>congestus</i>... alors que les cumulonimbus ont des esp&egrave;ces aux noms plus... capillaires tels que <i>calvus</i>, <i>capillatus</i>. Les tr&egrave;s gros cumulonimbus sont appel&eacute;s <i>mammatus</i>.</p>
        </blockquote>
        
        <p><a href="../base.html#exostruct">Retour au cours</a></p>

</body>
</html>
